app/controllers/ideas_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 4]]
---
  def show
    @comments = @idea.comments.all

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["picture", "#<ActionDispatch::Http::UploadedFile:0x007f1131865d28>"], ["created_at", "2017-09-16 07:24:27.120433"], ["updated_at", "2017-09-16 07:24:27.120433"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "name" = ?, "description" = ?, "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "ThoTran"], ["description", "dedemomo"], ["picture", "#<ActionDispatch::Http::UploadedFile:0x007f1130605098>"], ["updated_at", "2017-09-16 07:24:57.911615"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)